.src/frontend/0-http.org
#+TITLE: HTTP

HTTP (超文本传输协议) 是一个简单的请求-响应协议，它通常运行在 TCP 之上。

* HTTP (Hyper Text Transfer Protocol)

基本特点:
- 基于请求-响应 (Request - Response)
- 无状态的

HTTP 是无状态的:
- 任何请求都是独立的，无法区分。服务器不记录状态
- 优点: 简单；高效；健壮；适用性广
- 但是，我们通常的业务请求，需要是有状态的
- 因此，需要基于这种无状态进行状态的维护:
  + Url 重写 (把所有需要保存的状态，都通过 url 的方式进行传递)
  + Cookie 机制 (把所有需要保存的状态，通过 http head 进行传递。浏览器会自动处理)
- 基于 Cookie 的方式，进行频繁的数据传递，有若干缺点：
  + 不是那么安全
  + 传递数据量大的话，影响效率
  + Cookie 中保存的东西是基于字符串的，不是基于类型的
  + 浏览器本身对 Cookie 的大小是有限制的
- 在状态保证中，最核心的问题是区分各个请求。所以最重要保存、传递的数据是【身份凭证】。
  而其他跟这个【身份】相关的数据，都可以让服务器自行处理。
  这时，就出现了 Session 的概念。

* 请求方法

- GET/POST

* 响应码

- 20X
- 30X
- 404
- 50X
