html/frontend/0-http.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2022-10-24 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>HTTP</title>
<meta name="author" content="1a2y" />
<meta name="generator" content="Org Mode" />
<link rel='stylesheet' href='/html/asset/common.css?3344' />
<link rel='stylesheet' href='/yaoliuyao/html/asset/common.css?3344' />
</head>
<body>
<div id="content" class="content">
<header>
<h1 class="title">HTTP</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org8aff3c0">1. HTTP (Hyper Text Transfer Protocol)</a></li>
<li><a href="#orgd069db4">2. 请求方法</a></li>
<li><a href="#orge6d5970">3. 响应码</a></li>
</ul>
</div>
</nav>
<p>
HTTP (超文本传输协议) 是一个简单的请求-响应协议，它通常运行在 TCP 之上。
</p>

<section id="outline-container-org8aff3c0" class="outline-2">
<h2 id="org8aff3c0"><span class="section-number-2">1.</span> HTTP (Hyper Text Transfer Protocol)</h2>
<div class="outline-text-2" id="text-1">
<p>
基本特点:
</p>
<ul class="org-ul">
<li>基于请求-响应 (Request - Response)</li>
<li>基于文本 (字符串)</li>
<li>无状态的</li>
</ul>

<p>
HTTP 是无状态的:
</p>
<ul class="org-ul">
<li>任何请求都是独立的，无法区分。服务器不记录状态</li>
<li>优点: 简单；高效；健壮；适用性广</li>
<li>但是，我们通常的业务请求，需要是有状态的</li>
<li>因此，需要基于这种无状态进行状态的维护:
<ul class="org-ul">
<li>Url 重写 (把所有需要保存的状态，都通过 url 的方式进行传递)</li>
<li>Cookie 机制 (把所有需要保存的状态，通过 http head 进行传递。浏览器会自动处理)</li>
</ul></li>
<li>基于 Cookie 的方式，进行频繁的数据传递，有若干缺点：
<ul class="org-ul">
<li>不是那么安全</li>
<li>传递数据量大的话，影响效率</li>
<li>Cookie 中保存的东西是基于字符串的，不是基于类型的</li>
<li>浏览器本身对 Cookie 的大小是有限制的</li>
</ul></li>
<li>在状态保证中，最核心的问题是区分各个请求。所以最重要保存、传递的数据是【身份凭证】。
而其他跟这个【身份】相关的数据，都可以让服务器自行处理。
这时，就出现了 Session 的概念。</li>
</ul>
</div>
</section>

<section id="outline-container-orgd069db4" class="outline-2">
<h2 id="orgd069db4"><span class="section-number-2">2.</span> 请求方法</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>GET/POST</li>
</ul>
</div>
</section>

<section id="outline-container-orge6d5970" class="outline-2">
<h2 id="orge6d5970"><span class="section-number-2">3.</span> 响应码</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>20X</li>
<li>30X</li>
<li>404</li>
<li>50X</li>
</ul>
</div>
</section>
</div>
<div id="postamble" class="status">
<p class="author">Author: 1a2y</p>
<p class="date">Created: 2022-10-24</p>
<p class="validation">Go ahead, never stop.</p>
</div>
</body>
</html>
